benchmark-results/round-3-intel-full-atillery/dragonfly - 2.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      1036891.21          ---          ---         1.48467         1.47900         1.79100         1.95100         2.33500         2.59100         2.79900         2.86300         3.32700        12.54300     68743.67 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1036891.21         0.00         0.00         1.48467         1.47900         1.79100         1.95100         2.33500         2.59100         2.79900         2.86300         3.32700        12.54300     68743.67 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       107283.70          ---          ---         1.30189         1.29500         1.56700         1.71100         2.06300         2.30300         2.51100         2.62300         2.99100         3.71100      7123.65 
Gets      1072825.20      5881.44   1066943.75         1.30168         1.29500         1.56700         1.71100         2.04700         2.30300         2.51100         2.62300         3.00700         3.71100     43073.63 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1180108.90      5881.44   1066943.75         1.30170         1.29500         1.56700         1.71100         2.04700         2.30300         2.51100         2.62300         3.00700         3.71100     50197.28 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        35173.73          ---          ---         0.50142         0.46300         0.67100         0.75100         0.96700         1.11100         1.21500         1.25500         1.35900         1.79900      2335.50 
Gets       351690.85      2073.59    349617.25         0.50097         0.46300         0.67100         0.75100         0.96700         1.11900         1.22300         1.25500         1.33500         1.80700     14123.31 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     386864.57      2073.59    349617.25         0.50101         0.46300         0.67100         0.75100         0.96700         1.11900         1.22300         1.25500         1.33500         1.80700     16458.82 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        94476.22          ---          ---         1.48197         1.47900         1.79100         1.95100         2.31900         2.57500         2.78300         2.84700         3.07100         3.85500      6263.59 
Gets       944751.84    944751.84         0.00         1.48181         1.47900         1.79100         1.95100         2.31900         2.57500         2.79900         2.86300         3.08700         4.01500     58021.97 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1039228.07    944751.84         0.00         1.48183         1.47900         1.79100         1.95100         2.31900         2.57500         2.79900         2.86300         3.08700         4.01500     64285.55 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        33381.27          ---          ---         0.52747         0.48700         0.70300         0.79100         0.99900         1.15100         1.26300         1.31900         1.99100         2.33500      2213.02 
Gets       333768.62    333768.62         0.00         0.52726         0.48700         0.70300         0.79100         0.99900         1.14300         1.25500         1.28700         1.57500         2.46300     20498.26 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     367149.89    333768.62         0.00         0.52728         0.48700         0.70300         0.79100         0.99900         1.14300         1.25500         1.28700         1.63100         2.46300     22711.28